support/artillery.tests.yml
config:
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 2
      name: Ramp up the load slowly
  payload:
    path: './osuIds.csv'
    fields:
      - 'id'
    order: random
    skipHeader: true
  environments:
    development:
      target: https://dev.my.oregonstate.edu
    stage:
      target: https://stage.my.oregonstate.edu
    production:
      target: https://prod.my.oregonstate.edu
      phases:
        - duration: 300
          arrivalRate: 5
  variables:
    osuId: '{{ $processEnvironment.ARTILLERY_API_OSUID }}'
    key: '{{ $processEnvironment.ARTILLERY_API_KEY }}'
scenarios:
  - name: As a student, visit the Home page
    flow:
      - get:
          url: '/login?osuId={{ osuId }}&key={{ key }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/alerts
      - get:
          url: /api/alerts/dx
      - get:
          url: /api/info-buttons
      - get:
          url: /api/healthcheck
      - get:
          url: /api/user
      - get:
          url: /api/student/class-schedule?term=current
      - get:
          url: /api/student/planner-items
      - get:
          url: /api/events/academic-calendar
      - get:
          url: /api/resources/category/featured
      - get:
          url: /api/resources/categories
      - get:
          url: /api/announcements
      - get:
          url: /api/events?type=115613&days=30
  - name: As a student, visit the Academics Dashboard page
    flow:
      - get:
          url: '/login?osuId={{ osuId }}&key={{ key }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/alerts
      - get:
          url: /api/alerts/dx
      - get:
          url: /api/info-buttons
      - get:
          url: /api/healthcheck
      - get:
          url: /api/user
      - get:
          url: /api/student/class-schedule?term=current
      - get:
          url: /api/student/planner-items
      - get:
          url: /api/student/gpa
      - get:
          url: /api/student/academic-status
      - get:
          url: /api/student/academic-status
      - get:
          url: /api/student/holds
      - get:
          url: /api/events/academic-calendar
      - get:
          url: /api/resources/category/academic
      - get:
          url: /api/resources/categories
      - get:
          url: /api/announcements/academic
  - name: As a student, visit the Academics Academic History page
    flow:
      - get:
          url: '/login?osuId={{ osuId }}&key={{ key }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/alerts
      - get:
          url: /api/alerts/dx
      - get:
          url: /api/info-buttons
      - get:
          url: /api/healthcheck
      - get:
          url: /api/user
      - get:
          url: /api/student/grades
      - get:
          url: /api/student/grades
  - name: As a student, visit the Resources page
    flow:
      - get:
          url: '/login?osuId={{ osuId }}&key={{ key }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/alerts
      - get:
          url: /api/alerts/dx
      - get:
          url: /api/info-buttons
      - get:
          url: /api/healthcheck
      - get:
          url: /api/user
      - get:
          url: /api/resources/categories
      - get:
          url: /api/resources
  - name: As a student, visit the Finances
    flow:
      - get:
          url: '/login?osuId={{ osuId }}&key={{ key }}'
      - post:
          url: /api/masquerade
          json:
            masqueradeId: '{{ id }}'
      - get:
          url: /api/alerts
      - get:
          url: /api/alerts/dx
      - get:
          url: /api/info-buttons
      - get:
          url: /api/healthcheck
      - get:
          url: /api/user
      - get:
          url: /api/student/account-balance
      - get:
          url: /api/persons/meal-plans
      - get:
          url: /api/student/account-transactions
      - get:
          url: /api/resources/category/financial
      - get:
          url: /api/resources/categories
      - get:
          url: /api/announcements/financial